---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileReadOptions.XMLConfigFileName
source: html/cc56b621-a3b8-e083-0348-e1206559a869.htm
---
# Autodesk.Revit.DB.IFC.IFCFileReadOptions.XMLConfigFileName Property

The XML configuration file name. It is used only for reading IFC-XML format file.

## Syntax (C#)
```csharp
public string XMLConfigFileName { get; set; }
```

## Remarks
It uses default configuration if it is not set.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null